ednieuw/RTCcheck/Old/ESP32_RTCcheckV020/ESP32_RTCcheckV020.ino
/* 
 Author      : Ed Nieuwenhuijs ednieuw.nl
 Changes V001: Derived from ESP32Arduino_WordClockV098.ino
 Changes V002:  
 Changes V003: LED crashes with some rmt error. Runs on ESP32-S3-WROOM-DevKitC-1
 Changes V004: WIFI not connecting. Added in StartAPmode()  xTaskCreatePinnedToCore(WebServerTask,"WebServerTask", 4096, NULL, 1, NULL, 1 ); 
 Changes V005: WIFI not connecting. Added WS2812 and SK6812 LED-strip functionality to GPIO-pin 8 
 Changes V006: Equal to ESP32Arduino_WordClockV105.ino
 Changes V007: crashes when using EDSoftLED
 Changes V008: Equal to ESP32Arduino_WordClockV112.ino
 Changes V009: Added Title in WebPage() 
 Changes V010: Time functions updated. You can compile now By Arduino pin (default)
 Changes V011: Equal to ESP32Arduino_WordClockV132.ino
 Changes V012: Equal to ESP32_WordClockV150. Added RTCcheck V011 
 Changes V013: NUMLED 1 -> 14 LEDS. snprintf in SWversion() Timestamp/min ||hour in menu
 Changes V014: Print time /min /ht /off K2 K1 K0
 Changes V015: Equal to ESP32Arduino_WordClockV153.ino
 Changes V016: Added DoNotLog flag. Removed action="/get" <form id="commandForm" action="/get">
               changed to char* :-> PrintRTCTime());PrintNTPtime());PrintUTCtime()); PrintDS3231Time());
 Changes V017: Double printing of menu in Logging solved. Option K2 debugged. Equal to ESP32_WordClockV159
 Changes V018: Cosmetic.
 Changes V019: Cosmetic. Equal to ESP32Arduino_WordClockV160.ino
 Changes V020: Stable 

*********************
How to compile: 
Install ESP32 boards
Board: ESP32 core version >3.2.0 
Partition Scheme: With FAT
Pin Numbering: By Arduino pin (default)     -- > with EdsoftLED both can be used
               By GPIO number (legacy).     -- > When using NEOpixel
               when using By Arduino pin Error: Adafruit_NeoPixel/esp.c:78:(.text.espShow+0x55): undefined reference to `digitalPinToGPIONumber' 
USB mode: Normal (Tiny USB)
**********************

ESP32-S3-WROOM-DevKitC-1
Option	    Value
Board:      ESP32-S3 DEV Module on ESP32 core 3.3.3 
USB         CDC on Boot	Enabled
USB Mode	  Hardware CDC and JTAG (or just Hardware CDC)
Upload Mode	UART0 / Hardware Serial
Flash Mode	QIO 80MHz (default, or leave unchanged)
Port	      Select the UART COM port (the one with a USB-to-Serial chip)

*/
// =============================================================================================================================

//------------------------------------------------------------------------------              //
// ESP32 Includes defines and initialisations
//--------------------------------------------
                      #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL (5, 2, 0)            // Use EdSoftLED with ESP32 compiler.
#define USEEDSOFTLED  // Sometimes a flicker with Core 3.3.3 NEOPIXEL worka now also OK but need to set By GPIO number
                      #endif
                      #ifdef USEEDSOFTLED
#include <EdSoftLED.h>         // https://github.com/ednieuw/EdSoftLED for LED strip WS2812 or SK6812 
                      #else
#include <Adafruit_NeoPixel.h> // https://github.com/adafruit/Adafruit_NeoPixel  *** USE GPIO NUMBERING and compile By GPIO number (legacy) 
                      #endif
#include <Preferences.h>
#include <NimBLEDevice.h>      // For BLE communication. !!!Use NimBLE version 2.x.x  https://github.com/h2zero/NimBLE-Arduino
#include <WiFi.h>              // Used for web page 
#include <esp_sntp.h>          // for NTP
#include <esp_wps.h>           // For WPS
#include <ESPAsyncWebServer.h> // Used for webpage  https://github.com/ESP32Async 
#include <Update.h>            // For Over-the-Air (OTA)
#include <ESPmDNS.h>           // To show BLEname in router
#include <DNSServer.h>         // For the web page to enter SSID and password of the WIFI router 
#include <Wire.h>              // Ter zijner tijd Wire functies gaan gebruiken. Staan al klaar in de code 
#include <RTClib.h>            // Used for connected DS3231 RTC // Reference https://adafruit.github.io/RTClib/html/class_r_t_c___d_s3231.html
#include <Encoder.h>           // For rotary encoder
#include <Keypad.h>            // For 3x1 membrane keypad instead of rotary encoder by Mark Stanley & Alexander Brevig 
#include <IRremote.hpp>        // IR remote control

//------------------------------------------------------------------------------              //
// SPIFFS storage
//--------------------------------------------
Preferences FLASHSTOR;

                           #if defined(ARDUINO_NANO_ESP32)
//------------------------------------------------------------------------------              //
// PIN Assigments for Arduino Nano ESP32 (S3)
//------------------------------------------------------------------------------
 
enum DigitalPinAssignments {      // Digital hardware constants ATMEGA 328 ----
 SERRX        = D0,               // Connects to Bluetooth TX
 SERTX        = D1,               // Connects to Bluetooth RX
 encoderPinB  = D2,               //5,  // D2 left (labeled CLK on decoder)no interrupt pin (Use GPIO pin numbering for rotary encoder lib)  
 encoderPinA  = D3,               //6,  // D3 right (labeled DT on decoder)on interrupt pin
 clearButton  = D4,               //7,  // D4 switch (labeled SW on decoder)
 IRReceiverPin= D4,               // D4 Infrared receiver pin instead of rotary encoder
 LED_PIN      = D5,               //8,  // D5 / GPIO 8 Pin to control colour SK6812/WS2812 LEDs (replace D5 with 8 for NeoPixel lib)
 EmptyD6      = D6,               // D6 Empty
 EmptyD7      = D7,               // D7 Empty
 EmptyD8      = D8,               // D8 Empty 
 PCB_LED_D09  = D9,               // D9
 PCB_LED_D10  = D10,              // D10
 secondsPin   = D13               //48, // D13  GPIO48 (#ifdef LED_BUILTIN  #undef LED_BUILTIN #define LED_BUILTIN 48 #endif)
 };
 
enum AnaloguePinAssignments {     // Analogue hardware constants ----
 EmptyA0      = A0,               // Empty
 EmptyA1      = A1,               // Empty
 PhotoCellPin = A2,               // LDR pin
 OneWirePin   = A3,               // OneWirePin
 SDA_pin      = A4,               // SDA pin
 SCL_pin      = A5,               // SCL pin
 EmptyA6      = A6,               // Empty
 EmptyA7      = A7};              // Empty
 
                                  #else

