ednieuw/RTCcheck/Old/ESP32_RTCcheckV020/ESP32_RTCcheckV020.ino
//--------------------------------------------                                                //
// NTP Return local time as RTClib DateTime
//--------------------------------------------------------------------
DateTime GetLocalDateTime(){ return DateTime(GetTijd(false));}

//--------------------------------------------                                                //
// NTP print the NTP time for the timezone set 
// return true if time is valid
//--------------------------------------------------------------------
bool GetNTPtime(bool printit)
{
 sntp_set_sync_mode(SNTP_SYNC_MODE_IMMED);
 sntp_restart();
 if (getLocalTime(&timeinfo, 1000))                                                           // wait up to 1 seconds
    {  
      if (timeinfo.tm_year >= (2020 - 1900)) 
        {
         if (printit) PrintNTPtime();
         return true;
        }
    }
 return false;
}

//--------------------------------------------                                                //
// NTP Print current local (NTP) time
//--------------------------------------------------------------------
const char* PrintNTPtime(void)
{
 getLocalTime(&timeinfo);
 return(PrintRTCTime());                        // return pointer
}

//--------------------------------------------                                                //
// NTP print the NTP UTC time 
//--------------------------------------------------------------------
const char* PrintUTCtime(void)
{
 static char buf[40];   // persistent storage inside the function
 time_t now;
 time(&now);
 struct tm* UTCtime = gmtime(&now);
 if (!UTCtime) return(0);                                                                     // safety guard
 snprintf(buf, sizeof(buf),  "%02d-%s-%04d %02d:%02d:%02d ",
           UTCtime->tm_mday, monthNames[UTCtime->tm_mon],   // tm_mon = 0–11
           UTCtime->tm_year + 1900, UTCtime->tm_hour,
           UTCtime->tm_min, UTCtime->tm_sec);
 return buf;
}


//--------------------------------------------                                                //
// DS3231 check for I2C connection
// DS3231_I2C_ADDRESS (= often 0X68) = DS3231 module
//--------------------------------------------------------------------
bool IsDS3231I2Cconnected(void)
{
 for (byte i = 1; i < 120; i++)
   {
    Wire.beginTransmission(i);
    if (Wire.endTransmission() == 0 && i == DS3231_I2C_ADDRESS)
       return true;
   }
 return false;
}

//--------------------------------------------                                                //
// DS3231 temperature
//--------------------------------------------------------------------
float GetDS3231Temp(void)
{
  Wire.beginTransmission(DS3231_I2C_ADDRESS);
  Wire.write(0x11);
  Wire.endTransmission();
  Wire.requestFrom(DS3231_I2C_ADDRESS, 2);

  if (Wire.available())
   {
    byte tMSB = Wire.read();
    byte tLSB = Wire.read();
    return (tMSB & 0b01111111) + ((tLSB >> 6) * 0.25);
   }
  return -273.0;
}

//--------------------------------------------                                                //
// DS3231 RTC ESP32 -> DS3231
// Set time in module DS3231
//--------------------------------------------------------------------
void SetDS3231Time(void)
{
 return; //RTC8 
 DateTime tNow(timeinfo.tm_year + 1900, timeinfo.tm_mon + 1, timeinfo.tm_mday,
               timeinfo.tm_hour, timeinfo.tm_min, timeinfo.tm_sec);
 RTCklok.adjust(tNow);
 Tekstprintlnf("Time set in DS3231 RTC module: %s" ,PrintDS3231Time());
 if(!Mem.UseDS3231 && !Mem.NTPOn ) Tekstprintln("*** Not using DS3231");
}

//--------------------------------------------                                                //
// DS3231 reads time in module DS3231
// and store it in Word clock time structure
//--------------------------------------------------------------------
void GetDS3231Time(bool printit)
{
 DateTime Inow = RTCklok.now();
 timeinfo.tm_year = Inow.year() - 1900;
 timeinfo.tm_mon  = Inow.month() - 1;
 timeinfo.tm_mday = Inow.day();
 timeinfo.tm_hour = Inow.hour();
 timeinfo.tm_min  = Inow.minute();
 timeinfo.tm_sec  = Inow.second();
 if (printit) Tekstprintln(PrintDS3231Time());
}

//--------------------------------------------                                                //
// DS3231 Print DS3231 time
//--------------------------------------------------------------------
const char* PrintDS3231Time(void)
{
 static char buf[40];   // persistent storage inside the function 
 DateTime Inow = RTCklok.now();
 snprintf(buf, sizeof(buf), "%02d-%s-%04d %02d:%02d:%02d ",
          Inow.day() , monthNames[Inow.month()-1] , Inow.year(),
          Inow.hour(), Inow.minute(), Inow.second());
 return buf;
}
//--------------------------------------------                                                //
// RTC prints the ESP32 internal RTC time to sptext and web page
// usage: Tekstprintln(PrintRTCTime());
//--------------------------------------------
const char* PrintRTCTime()
{
 static char buf[40];   // persistent storage inside the function
 snprintf(buf, sizeof(buf), "%02d-%s-%04d %02d:%02d:%02d",
             timeinfo.tm_mday, monthNames[timeinfo.tm_mon], timeinfo.tm_year + 1900,
             timeinfo.tm_hour, timeinfo.tm_min,  timeinfo.tm_sec);
  return buf;
}
//--------------------------------------------                                                //
// RTC Print time as hh:mm:ss
//--------------------------------------------
const char* PrintHMSTime()
{
 static char buf[40];   // persistent storage inside the function
 snprintf(buf, sizeof(buf), "%02d:%02d:%02d",
             timeinfo.tm_hour, timeinfo.tm_min,  timeinfo.tm_sec);
  return buf;
}

//--------------------------------------------                                                //
// RTC Fill sptext with time as HMS hh:mm:ss
//--------------------------------------------
void PrintTimeHMS(){ PrintTimeHMS(2);}                                                        // print with linefeed
void PrintTimeHMS(byte format)
{
 snprintf(sptext, sizeof(sptext),"%02d:%02d:%02d ",timeinfo.tm_hour,timeinfo.tm_min,timeinfo.tm_sec);
 switch (format)
 {
  case 0: break;
  case 1: Tekstprint(sptext); break;
  case 2: Tekstprintln(sptext); break;  
 }
}

//--------------------------------------------                                                //
// RTC Set time in ESP32 using global timeinfo struct
//--------------------------------------------
void SetRTCTime(void) 
{ 
 time_t t = mktime(&timeinfo);                                                                // t= unixtime
 SetSystemTime(t);
}

//--------------------------------------------                                                //
// RTC Set RTC time using Unix timestamp
//--------------------------------------------
void SetSystemTime(time_t t)
{ 
 struct timeval tv = { .tv_sec = t, .tv_usec = 0 };
 settimeofday(&tv, nullptr);
 localtime_r(&t, &timeinfo);
 Tekstprint("ESP32 RTC time set: ");
 PrintTimeHMS();
}

//--------------------------------------------                                                //
// CLOCK Print all the times available 
//--------------------------------------------
void PrintAllClockTimes(void)
{
 Tekstprintf("\n Clock time: %s", PrintRTCTime());
 if(WiFi.localIP()[0] != 0)                                                                   // If no WIFI then no NTP time printed
   {
    Tekstprintf("\n   NTP time: %s", PrintNTPtime());
    Tekstprintf("\n   UTC time: %s", PrintUTCtime());
   }
 if(DS3231Installed)
    Tekstprintlnf("\nDS3231 time: %s", PrintDS3231Time());
}
//--------------------------- End Time functions --------------------------


//--------------------------------------------                                                //
// BLE SendMessage by BLE Slow in packets of 20 chars
// or fast in one long string.
// Fast can be used in IOS app BLESerial Pro
//------------------------------
void SendMessageBLE(std::string Message)
{
 if(deviceConnected) 
   {
    if (Mem.UseBLELongString)                                                                 // If Fast transmission is possible
     {
      pTxCharacteristic->setValue(Message); 
      pTxCharacteristic->notify();
      delay(10);                                                                              // Bluetooth stack will go into congestion, if too many packets are sent
     } 
   else                                                                                       // Packets of max 20 bytes
     {   
      int parts = (Message.length()/20) + 1;
      for(int n=0;n<parts;n++)
        {   
         pTxCharacteristic->setValue(Message.substr(n*20, 20)); 
         pTxCharacteristic->notify();
         delay(10);                                                                           // Bluetooth stack will go into congestion, if too many packets are sent
        }
     }
   } 
}

//--------------------------------------------                                                //
// BLE Start BLE Classes NimBLE Version 2.x.x
//------------------------------
class MyServerCallbacks: public NimBLEServerCallbacks 
{
 void onConnect(NimBLEServer* pServer, NimBLEConnInfo& connInfo) override 
    {deviceConnected = true; Tekstprintln("BLE Connected"   );}
 void onDisconnect(NimBLEServer* pServer, NimBLEConnInfo& connInfo, int reason) override 
    {deviceConnected = false; Tekstprintln("BLE Disconnected" );}
};
  
