ednieuw/RTCcheck/Old/ESP32_RTCcheckV020/ESP32_RTCcheckV020.ino
if (Mem.UseRotary == 4)                                                                       // {"MIN-1", "MIN+1","UUR-1","UUR+1","POWER","ONOFF"};
 {
 if (IR_PowerOnstate == false) // && ButtonNamesNr < 14 ) 
 {
 switch(ButtonNamesNr)
    {
    case 4:                                                                                   // Button "POWER"
            ToggleIRpower();
            break;
    case 5:                                                                                   // Button "ONOFF"
            ReworkInputString("O");                                                           // Turn On OFF display
            break;
    default:
            Tekstprintln("Turn On remote with POWER");
            break;
    }
  }
 else
   {
    switch(ButtonNamesNr)
     {
    case 0:                                                                                   // Button "MIN-1"
            AdjustTime(0, -1, 0);                                                             // -1 minute
            break;
    case 1:                                                                                   // Button "MIN+1"
            AdjustTime(0, 1, 0);                                                              // +1 minute
            break;
    case 2:                                                                                   // Button "UUR-1"
            AdjustTime(-1, 0, 0);                                                             // -1 hour
            break;
    case 3:                                                                                   // Button "UUR+1"
            AdjustTime(1, 0, 0);                                                              // +1 hour
            break;
    case 4:                                                                                   // Button "POWER"
            ToggleIRpower();
            break;
    case 5:                                                                                   // Button "ONOFF"
            ReworkInputString("O");                                                           // Turn On OFF display
            break;
    default:
            snprintf(sptext, sizeof(sptext), "Button '%s' not yet assigned", ButtonName.c_str());
            Tekstprintln(sptext);
            break;
      }
   }
 } // end if ==4
}

//--------------------------------------------                                                //
// IR-RECEIVER Adjust current time by hours/minutes/seconds
//--------------------------------------------
void AdjustTime(int DeltaHours, int DeltaMinutes, int DeltaSeconds)
{
 timeinfo.tm_hour += DeltaHours;
 timeinfo.tm_min  += DeltaMinutes;
 timeinfo.tm_sec  += DeltaSeconds;
 //time_t t = 
 mktime(&timeinfo);
 if(DS3231Installed)   SetDS3231Time();
 Displaytime(); Tekstprintln("");        
}

//--------------------------------------------                                                //
// IR-RECEIVER Turn On or off Remote control
// Turns off after 60 seconds
//--------------------------------------------
void ToggleIRpower(void)
{
 static bool powerState = false;                                                              //
 powerState = !powerState;
 if (powerState)
  {
   IR_PowerOnstate = true;                                                                    // React on IR-remote input
   Tekstprintln("IR-remote is ON");
   IR_StartTime = millis();
  }
 else
  {
    Tekstprintln("IR-remote is OFF");
    IR_PowerOnstate = false;                                                                  // Do not react on IR-remote input
  } 
}

//--------------------------------------------                                                //
// LOGBUFFER Initialize circular logging buffer      
//--------------------------------------------
void InitLogBuffer()
{
 size_t largest = heap_caps_get_largest_free_block(MALLOC_CAP_8BIT);
 size_t reserve = 8000; 
 StoredStartHeaps(true);                                                                      // Store the values before allocation                                                                               //                                     // Keep a safety margin tune this based on your system
 if (largest > reserve)        LogBufferSize = largest - reserve;
 else        LogBufferSize = largest / 2;
 LogBuffer = (char*)heap_caps_malloc(LogBufferSize, MALLOC_CAP_8BIT);
 if (!LogBuffer) { Tekstprintln("ERROR: Could not allocate log buffer"); return; }
 memset(LogBuffer, 0, LogBufferSize);
 LogWritePos = 0;
 LogWrapped  = false;
 snprintf(sptext, sizeof(sptext)," Log buffer allocated: %u bytes (largest block was %u)",
             (unsigned)LogBufferSize, (unsigned)largest);
 Tekstprintln(sptext);
}

//--------------------------------------------                                                //
// LOGBUFFER Add a log line (raw C-string). Always ends with '\n'.
//--------------------------------------------
void AddLog(const char* msg)
{
 if (DoNotLog) return;  
 if (!LogBuffer) return;
 size_t len = strlen(msg);
 if (len >= LogBufferSize)
    {
     msg += (len - LogBufferSize);  // keep only last part
     len = strlen(msg);
    }
    for (size_t i = 0; i < len; i++)
    {
     LogBuffer[LogWritePos++] = msg[i];
     if (LogWritePos >= LogBufferSize)
        {
         LogWritePos = 0;
         LogWrapped  = true;
        }
    }
}

//--------------------------------------------                                                //
// LOGBUFFER Stream the last 500 lines circular log buffer directly to the client
void HandleTekstPrint(AsyncWebServerRequest *request)
{
 if (!LogBuffer)
   {
     request->send(200, "text/plain", "Log buffer uninitialized\n");
     return;
   }
 AsyncResponseStream *response = request->beginResponseStream("text/plain");
 size_t lineCount = 0;
 ssize_t pos = LogWritePos;
 for (size_t scanned = 0; scanned < LogBufferSize && lineCount < 500; scanned++)              // Count lines backwards to find last 500 '\n's
    {
     pos = (pos == 0) ? LogBufferSize - 1 : pos - 1;
     if (LogBuffer[pos] == '\n') lineCount++;
     if (!LogWrapped && pos == 0) break;                                                      // Stop if buffer not wrapped
    }
   size_t start = (pos + 1) % LogBufferSize;                                                  // Now pos points to the start of the 500th-last line (or beginning)
 if (!LogWrapped || start < LogWritePos)                                                      // Stream lines from start → end of buffer
   {
    response->write(LogBuffer + start, LogWritePos - start);
   }
 else
   {
    response->write(LogBuffer + start, LogBufferSize - start);                               // Wrap: first part from start → end of buffer
    response->write(LogBuffer, LogWritePos);                                                 // second part from 0 → write pos
   }
 request->send(response);
}

//--------------------------------------------                                                //
// LOGBUFFER Stream all the circular log buffer directly to the client
//--------------------------------------------
void HandleTekstDownload(AsyncWebServerRequest *request)
{
 if (!LogBuffer)
   {
    request->send(200, "text/plain", "Log buffer uninitialized\n");
    return;
   }
 AsyncResponseStream *response = request->beginResponseStream("text/plain");
 if (!LogWrapped)     response->write(LogBuffer, LogWritePos);
 else
   {
    size_t tail = LogBufferSize - LogWritePos;
    response->write(LogBuffer + LogWritePos, tail);
    response->write(LogBuffer, LogWritePos);
   }
    request->send(response);
}

/// ringbuffer





//--------------------------------------------                                                //
// RTC8 
//-------------------------------------------- 
RTC_DS3231 rtc[MAX_RTC];                                                                      // RTC objecten aanmaken
bool rtcActive[MAX_RTC] = {false};                                                            // Array om bij te houden welke RTC's werkend zijn
int activeRTCCount     = 0;

//--------------------------------------------                                                //
// RTC8 Initialyse all connected RTC's
//--------------------------------------------
void SetupRTCs(void) 
{
  Serial.println("DS3231 RTC Multiplexer Test");
  Serial.println("===========================");
  sprintf(sptext, "Software: %s", SoftwareName());  Tekstprintln(sptext);   
  
