ednieuw/RTCcheck/Old/ESP32_RTCcheckV020/ESP32_RTCcheckV020.ino
//--------------------------------------------
// RTC8 Calculate difference in sec from NTP
//--------------------------------------------
void CalcDifRTCtimes(void)
{
 struct tm ntp_tm = timeinfo;
 ntp_tm.tm_isdst = -1;
 const time_t tNTP = mktime(&ntp_tm);
 for (int i = 0; i < MAX_RTC; i++)
   {
    if (!rtcActive[i]) { RTCdiffSec[i] = -1; continue; }
    selectTCAChannel(i);
    delay(10);
    RTCdiffSec[i] = abs(tNTP - To_time_t(rtc[i].now()));
   }
}



//--------------------------------------------                                                //
// RTC8 Function to select TCA9548A channel
//--------------------------------------------
void selectTCAChannel(uint8_t channel) 
{
  if (channel > 7) return;                                                                    // Maximaal 8 kanalen (0-7)
  Wire.beginTransmission(TCA_ADDR);
  Wire.write(1 << channel);                                                                   // Select channel by setting bit
  uint8_t error = Wire.endTransmission();
  
  if (error != 0) 
   {
    sprintf(sptext,"Error selecting channel %d Error code : %d", channel,error);
    Tekstprintln(sptext);  
  }
  delay(10);                                                                                  // short delay after channel change
}
//--------------------------------------------                                                //
// RTC8 set Time For RTC 
//--------------------------------------------
void SetTimeForRTC(int rtcIndex, DateTime newTime) 
{
  if (!rtcActive[rtcIndex]) return;
  selectTCAChannel(rtcIndex);
  rtc[rtcIndex].adjust(newTime);
}
//--------------------------------------------                                                //
// RTC8 Print Time For RTC 
//--------------------------------------------
void PrintTimeForRTC(int rtcIndex) 
{
  if (!rtcActive[rtcIndex]) return;
  selectTCAChannel(rtcIndex);
  DateTime now = rtc[rtcIndex].now();

  sprintf(sptext,"RTC %d: %s", rtcIndex, now.timestamp(DateTime::TIMESTAMP_FULL).c_str());
  Tekstprintln(sptext);  
}
//--------------------------------------------                                                //
// RTC8 get Temperature For RTC
//--------------------------------------------
float GetTemperatureForRTC(int rtcIndex) 
{
  if (!rtcActive[rtcIndex]) return -999;
  selectTCAChannel(rtcIndex);
  return rtc[rtcIndex].getTemperature();
}
//--------------------------------------------                                                //
// RTC8 Synchronize all RTC's with current time
//--------------------------------------------
void SynchronizeAllRTCs()   // Zoek eerste actieve RTC als referentie
{
  int referenceRTC = -1;
  for (int i = 0; i < MAX_RTC; i++) { if (rtcActive[i]) { referenceRTC = i;   break;  }  }
  if (referenceRTC == -1)           { Tekstprintln("No active RTC's found!"); return;  }
  
  selectTCAChannel(referenceRTC);
  DateTime referenceTime = GetLocalDateTime() + 1;                                            // Get the current time and add 1 sec setting time  
  
  Tekstprintln("\n=== RTC SYNCHRONISATION ===");
  sprintf(sptext,"Reference time of NTP RTC %d: %s", referenceRTC, referenceTime.timestamp(DateTime::TIMESTAMP_FULL).c_str());
  Tekstprintln(sptext);

  for (int i = 0; i < MAX_RTC; i++) 
   {
    if (!rtcActive[i]) continue;
    selectTCAChannel(i);
    delay(50);
    DateTime before = rtc[i].now();                                                           // Show time before update
    sprintf(sptext,"RTC %d: before sync %s", i, before.timestamp(DateTime::TIMESTAMP_FULL).c_str());
    Tekstprintln(sptext);
    rtc[i].adjust(referenceTime);                                                             // Update time
    delay(50); 
    DateTime after = rtc[i].now();                                                            // Verify
    sprintf(sptext,"RTC %d:  after sync %s", i, after.timestamp(DateTime::TIMESTAMP_FULL).c_str());
    Tekstprintln(sptext);
  }
 Tekstprintln("Synchronisation done!\n");
}

//--------------------------------------------                                                //
// RTC8 Set time by hand in serial monitor
//--------------------------------------------
void SetCurrentTime() 
{
 int year, month, day, hour, minute, second;                                                 //
 hour   = timeinfo.tm_hour;
 minute = timeinfo.tm_min;
 second = timeinfo.tm_sec;
 year   = timeinfo.tm_year + 1900;                                                            // Inow.year() is years since 2000 tm_year is years since 1900
 month  = timeinfo.tm_mon  + 1;
 day    = timeinfo.tm_mday;
 DateTime newTime(year, month, day, hour, minute, second);
 Tekstprint("New time: ");
 Tekstprintln(newTime.timestamp(DateTime::TIMESTAMP_FULL).c_str());
 for (int i = 0; i < MAX_RTC; i++) 
    {
     if (!rtcActive[i]) continue;
     selectTCAChannel(i);
     delay(50);      
     DateTime before = rtc[i].now();                                                         // Show time before update
     sprintf(sptext,"RTC %d: before sync %s", i, before.timestamp(DateTime::TIMESTAMP_FULL).c_str());
     Tekstprintln(sptext);
     rtc[i].adjust(newTime);
     delay(50);
     DateTime after = rtc[i].now();                                                          // Verify
     sprintf(sptext,"RTC %d: after sync %s", i, after.timestamp(DateTime::TIMESTAMP_FULL).c_str());
     Tekstprintln(sptext);
    }
 Tekstprintln("All active RTC's updated!\n");
}
